import {removeRepeatLine} from "../../src/js/rmRepeatLine";
import { expect } from "chai";

describe("utils.js", () => {
    //分离
    let p1=[[10,20,10,30],[10,35,10,70]];
    //两个部分重叠
    let p2=[[10,20,10,80],[10,30,10,90]];
    //第一个完全包含第二个
    let p3=[[10,20,10,80],[10,30,10,40]];
    //第二个完全包含第一个
    let p4 = [[10, 30, 10, 40], [10, 20, 10, 80]];
    //第二部分在前,有重叠
    let p5 = [[10, 20, 10, 80], [10, 10, 10, 30]];
    //没有顺序,有重叠
    let p6=[[10,80,10,20],[10,30,10,90]];
    // y=2x+3 有重叠
    let p7 = [[10, 23, 20, 43], [15, 33, 30, 63]];
    // 没重叠
    let p8 = [[10, 23,15,33], [20, 43,30,63]];
    it("分离: [[10,20,10,30],[10,35,10,70]]", () => {
        expect(removeRepeatLine(...p1)).to.eql([[10, 20, 10, 30], [10, 35, 10, 70]]);
    })
    it("按顺序重叠: [[10,20,10,80],[10,30,10,90]]", () => {
        expect(removeRepeatLine(...p2)).to.eql([[10, 20, 10, 90]]);
    })
    it("第一个完全包含第二个: [[10,20,10,80],[10,30,10,40]]", () => {
        expect(removeRepeatLine(...p3)).to.eql([[10, 20, 10, 80]]);
    })
    it("第2个完全包含第1个: [[10, 30, 10, 40], [10, 20, 10, 80]]", () => {
        expect(removeRepeatLine(...p4)).to.eql([[10, 20, 10, 80]]);
    })
    it("第二部分在前,有重叠: [[10, 20, 10, 80], [10, 10, 10, 30]]", () => {
        expect(removeRepeatLine(...p5)).to.eql([[10, 10, 10, 80]]);
    })
    it("没有顺序,有重叠: [[10,80,10,20],[10,30,10,90]]", () => {
        expect(removeRepeatLine(...p6)).to.eql([[10, 20, 10, 90]]);
    })
    it("斜线,有重叠: [[10,23,20,43],[15,33,30,63]]", () => {
        expect(removeRepeatLine(...p7)).to.eql([[10, 23, 30, 63]]);
    })
    it("斜线,无重叠: [[10, 23,15,33], [20, 43,30,63]]", () => {
        expect(removeRepeatLine(...p8)).to.eql([[10, 23, 15, 33], [20, 43, 30, 63]]);
    })
})